000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. RENEWAL.
000300 ENVIRONMENT DIVISION.
000400 INPUT-OUTPUT SECTION.
000500 FILE-CONTROL.
000600     SELECT POLICY-FILE ASSIGN TO 'POLICY.DAT'.
000700 DATA DIVISION.
000800 FILE SECTION.
000900 FD POLICY-FILE.
001000 01 POLICY-REC.
001100     05 POL-NUM       PIC 9(6).
001200     05 STATE         PIC XX.
001300     05 AGE           PIC 9(2).
001400     05 VEHICLE       PIC X.
001500     05 CLAIMS        PIC 9(2).
001600     05 BASE-PREM     PIC 9(4)V99.
001700 WORKING-STORAGE SECTION.
001800 01 NEW-PREM          PIC 9(5)V99.
001900 PROCEDURE DIVISION.
002000 MAIN.
002100     OPEN INPUT POLICY-FILE.
002200 READ-REC.
002300     READ POLICY-FILE
002400         AT END GO TO END-PROG.
002500     PERFORM CALC-PREM.
002600     DISPLAY POL-NUM NEW-PREM.
002700     GO TO READ-REC.
002800 CALC-PREM.
002900     MOVE BASE-PREM TO NEW-PREM.
003000     IF AGE > 50
003100         ADD 25 TO NEW-PREM.
003200     IF CLAIMS > 0
003300         ADD CLAIMS * 50 TO NEW-PREM.
003400 END-PROG.
003500     CLOSE POLICY-FILE.
003600     STOP RUN.
