000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. RENEWAL.
000300 ENVIRONMENT DIVISION.
000400 INPUT-OUTPUT SECTION.
000500 FILE-CONTROL.
000600     SELECT POLICY-FILE ASSIGN TO 'POLICY.DAT'.
000700 DATA DIVISION.
000800 FILE SECTION.
000900 FD POLICY-FILE.
001000 01 POLICY-REC.
001100     05 POL-NUM       PIC 9(6).
001200     05 STATE         PIC XX.
001300     05 AGE           PIC 9(2).
001400     05 VEHICLE       PIC X.
001500     05 CLAIMS        PIC 9(2).
001600     05 BASE-PREM     PIC 9(5)V99.
001700 WORKING-STORAGE SECTION.
001800 01 NEW-PREM          PIC 9(6)V99.
001900 PROCEDURE DIVISION.
002000 MAIN-LOOP.
002100     OPEN INPUT POLICY-FILE.
002200     READ POLICY-FILE
002300         AT END STOP RUN.
002400     PERFORM CALCULATE.
002500     DISPLAY POL-NUM NEW-PREM.
002600     GO TO MAIN-LOOP.
002700 CALCULATE.
002800     MOVE BASE-PREM TO NEW-PREM.
002900     IF AGE > 50
003000         ADD 25 TO NEW-PREM.
003100     IF CLAIMS > 0
003200         MULTIPLY CLAIMS BY 50 GIVING NEW-PREM.
